Revit 2026 API

# CurveElementGetAreaBasedLoadBoundaryLineData Method

---

Gets the area based load boundary line data from this curve, if applicable.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public AreaBasedLoadBoundaryLineData GetAreaBasedLoadBoundaryLineData()
```
```vb
Public Function GetAreaBasedLoadBoundaryLineData As AreaBasedLoadBoundaryLineData
```
```cpp
public:
AreaBasedLoadBoundaryLineData^ GetAreaBasedLoadBoundaryLineData()
```
```fsharp
member GetAreaBasedLoadBoundaryLineData : unit -> AreaBasedLoadBoundaryLineData
```

#### Return Value

AreaBasedLoadBoundaryLineData The area based load boundary line data, if this is an area based load boundary, or  otherwise.

Will return  if curve element isn't an area based load boundary line.

#### Reference

CurveElement Class

Autodesk.Revit.DB Namespace